[{"location": "Berlin", "title": "Active Germany", "people": ["https://github.com/MaschiniDev"], "url": "https://hackdash.org/projects/56223affd7a1daf032edaa87", "description": "Die Perfekte App um die Sitten und Sprachen anderer Kulturen in der Freizeit kennenzulernen!\n\nWenn du \"Active Germany\" benutzt, siehst du direkt die nächsten Veranstaltungen in deiner Nähe!\nPerfekt um Menschen aus anderen Kulturen kennenzulernen und Leute in die eigene Kultur einzuführen.\n\n-Android App\n\nTeam: Johanna, Jonas, Malte, Nele, Nina, Noah, Tomas"}, {"location": "Berlin", "title": "UDE", "people": ["https://github.com/M0ritzWeide", "https://twitter.com/PascalKienast", "https://twitter.com/charlypuh_x3"], "url": "https://hackdash.org/projects/56223e45d7a1daf032edaa89", "description": "Der UDE besteht aus einem Hardware und einem Software Teil. Dabei sendet der Hardware Teil (eine kleine Box mit Sensoren) Wetterdaten an den Software Teil wo die Daten dann verarbeitet und in eine Datenbank gespeichert werden. Diese ist dann erreichbar über eine Web oder eine Android App (IOS APP folgt) sowie eine API.\n\n\nFrontend: https://github.com/pascalkienast/Umweltdaten-App\n\nAndroid App: https://play.google.com/store/apps/details?id=com.ude.box"}, {"location": "Berlin", "title": "Fuck Borders", "people": ["https://github.com/MuhPirat", "https://twitter.com/H4G1_"], "url": "https://hackdash.org/projects/56224128d7a1daf032edaa8c", "description": "Von Hagi, Mumu, Iliass, Finn, Kealu und Mika\n\nDas Projekt soll es ermöglichen, Grenzanlagen, egal ob mobil oder persistent, zu mappen und Informationen zu Standort, Sicherheitsmaßnahmen, etc. öffentlich zugänglich zu machen. Dabei soll das Überqueren von Grenzen für Refugees vereinfacht werden.Die Daten erhalten wir von der \"Crowd\" also von einer Gemeinschaft von Menschen, die die Daten sammeln und in einem Webformular zusammentragen. Das Frontend setzen wir in HTML, JavaScript und CSS um, das Backend in PHP. Um die Daten zu visualisieren nutzen wir das Kartenmaterial des OpenStreetmap Projektes.\n\n"}, {"badges": ["Aha Moment"], "url": "https://hackdash.org/projects/5622425ad7a1daf032edaa8d", "people": ["https://twitter.com/BlackTigersHD", "https://twitter.com/alexsteinerde"], "badges_raw": ["innovation"], "location": "Berlin", "description": "Mit diesem Projekt versuchen wir, Musik auf mehreren Geräten gleichzeitig abzuspielen. Dafür müssen wir die Geräte dazu bringen, genau zum gleichen Zeitpunkt zu starten.\nZur Synchronisierung wird ein Gerät als \"Master\" bestimmt, das wortwörtlich den Ton angibt. Es spielt vor jedem Lied eine festgelegte Reihe von Tönen. Diese werden vom Empfängergerät, dem \"Servant\", aufgenommen und mit einem Algorythmus analysiert. Entsprechen sie dem Signal, wird das Lied gestartet, zum gleichen Zeitpunkt wie auf dem Master. Für das Synchronisationssignal nutzen wir hohe Frequenzen, die für das menschliche Ohr nicht wahrnehmbar sind.\nBei diesem Projekt kommt es uns auf die Plattformunabhängigkeit an, die wir durch die akustische Kommunikation erreichen.\nIn Zukunft kann man das Projekt zum Beispiel erweitern, indem man ein breiteres Maß an Musik anbietet. Zur Verfügung stellen wir eine App für Android sowie eine für iOS, die je nativ in ihren plattformeigenen Programmiersprachen geschrieben sind (Java für Android und Swift für iOS).\nNamen: MatzE, Philipp (@tudi), Hartmut, Lukas (@BlackTigers), Nicolas (@d0cod3r), Alex (@alexsteinerde)", "title": "MusicSync"}, {"badges": ["Sonderpreis"], "url": "https://hackdash.org/projects/56224ad7d7a1daf032edaa94", "people": ["https://github.com/annabertsch", "https://github.com/Pr0duktiv", "https://github.com/Breuxi", "https://github.com/games647", "https://github.com/NullP0interEx", "https://twitter.com/pajowu"], "badges_raw": ["special"], "location": "Berlin", "description": "Mit dem Projekt 'Germany says Welcome' widmen wir uns einem der aktuellsten Themen überhaupt- Der großen Anzahl an Flüchtigen in Deutschland. Diese Flüchtlinge fühlen sich hier oft hilflos, alleingelassen und überfordert vom Informationsfluss. Das wollen wir ändern. 'Germany says Welcome' soll sowohl als App als auch im Netz eine Plattform für Informationen, Hilfe und Unterstützung bei der Integration dienen. Sowohl Flüchtlinge als auch freiwillige Helfer sollen die Möglichkeit zum Austausch auf dieser Plattform haben und damit eine Möglichkeit haben, Deutschland vielleicht zu einem etwas weltoffneren Ort zu machen. Inzwischen sind wir auch online.- Auf http://www.germany-says-welcome.de\n\nProjekt von Patrice Becker, Anna Bertsch, Jan Breuer, Pierre Buschmann, Moritz Gehlhaar, Roman Kobosil, Kevin Schatto, Alexander Siegler und David Weber", "title": "Germany Says Welcome"}, {"location": "Berlin", "title": "Servoxit", "people": ["https://github.com/noahlotzer", "https://github.com/YannisHeine"], "url": "https://hackdash.org/projects/56224bb0d7a1daf032edaa95", "description": "Servoxit ist ein Projekt zum Überwachen und verwalten von Root sowie V-Servern. Die Verwaltung erfolgt über ein Webinterface sowie über eine Smartphone App.\n\nFunktionen:\n * Graphische Überwachung von RAM sowie CPU Auslastung\n * One-Klick Installationen\n * Restarten von Servern\n * Lesen von Logs sowie Push/Email Benachrichtigungen bei Auftreten von Fehlern.\n\n\nGithub: https://github.com/noahlotzer/Servoxit"}, {"location": "Berlin", "title": "SMART MIRROR", "people": ["https://twitter.com/MoritzUnseld"], "url": "https://hackdash.org/projects/562252d1d7a1daf032edaa98", "description": "Smart Mirror is a mirror, that displays the time, the weather and cloth suggestions.\n\nMoritz + René"}, {"badges": ["Mit Code die Welt verbessern"], "url": "https://hackdash.org/projects/5622531ad7a1daf032edaa99", "people": ["https://github.com/Nobody234"], "badges_raw": ["world"], "location": "Berlin", "description": "Von: Emile, Alex, Jakob, Tobias, Sam, Simon, Linus\n\nDanke an: Stefan, Fab lab, alle von Jugend Hackt\n\nUnser Projekt bezieht sich auf ein intelligentes Ampelsystem für Großstädte mit großen Kreuzungen. Die Ampeln können Spezifisch auf den Verkehr eingehen und vor allem Fußgänger und Fahrradfahrer berücksichtigt. Sinnlose Minuten an einer Ampel sind vorbei! Die Ampelanlage reagiert auf die Menge der Fahrzeuge und kann auf besondere Ereignisse eingehen. verschiedene Sensoren in Straßenlampen werden an weiterentwickelte Ampeln geliefert, diese verarbeitet die Informationen und reagiert dementsprechend. Das ganze System macht den Verkehr nicht nur für Fußgänger und Fahrradfahrer sicherer und schneller. ", "title": "Latampel"}, {"location": "Berlin", "title": "Scan ess einfach!", "people": ["https://twitter.com/Toxicola_", "https://twitter.com/volume4k", "https://twitter.com/jalotis", "https://github.com/HermineSunshine"], "url": "https://hackdash.org/projects/562255d9d7a1daf032edaa9f", "description": "Warum \"Scan ess einfach\"?\n\nWenn du mit \"Scan ess einfach\" einen Barcode scannst, werden die Inhaltsstoffe eines Lebensmittels aufgelistet und definiert. \nWir entwickeln gerade eine Website die deine Barcodes scannt und die Inhaltsstoffe aus einer Datenbank herausfiltert. \n\nWir bald hinzugefügt:\n+ iPhone App\n+ Datenbank Erweiterung\n+ Medikamente werden hinzugefügt\n+ Filter für Beispielsweise Allergien\n\nTeam:\n- Leeloo Schindelhauer (Java)\n- Olivia Ley (HTML, MySQL)\n- Jonathan Kowa (PHP, HTML)\n- Henning Klatt (Python, Web)\n- Janek Wunderlich (Java, Datenbank)\n- Ilias Ennmouri (Swift / Objective-C, Web)"}, {"location": "Berlin", "title": "Refugee Phracebook", "people": ["https://twitter.com/Mondanzo", "https://twitter.com/html5ben"], "url": "https://hackdash.org/projects/562259dcd7a1daf032edaab0", "description": "Refugee Phracebook ist ein Projekt bei dem man alle wichtigen informationen über das Leben der flüchtlinge finden kann\n\n\n\n\n\n\n\n\nPhoto: http://www.dabbledstudios.com/wp-content/uploads/2011/08/sq-med.jpg\n\nTest unter http://5.230.156.101/html/White.html"}, {"location": "Berlin", "title": "Lichtfelddisplay", "people": ["https://github.com/SelfGamer", "https://twitter.com/tursics"], "url": "https://hackdash.org/projects/56225c1fd7a1daf032edaab1", "description": "Projekt Lichtfelddisplay von Ruth und Birk:\n\nUnser Projekt soll u.a.  eine 3D- Illusion erschaffen, welches dem menschlichen Auge ermöglicht, ein Objekt aus verschiedenen Perspektiven zu betrachten und somit einen 3-dimensionalen Effekt hervorzurufen.\n\nDurch unser Display können wir einige Probleme, welche durch 3D- Fernseher auftreten preisgünstig lösen.\nUnser Display hat die Vorzüge, dass man für den 3D-Effekt keine 3D-Brillen braucht,aus einigen Perspektiven des Betrachters eine 3D-Illusion zu erzeugen und dieses 3D-Bild sogar aus verschiedenen Positionen darstellen zu können.\n\nZunächst haben wir die Linsen für das Display mithilfe des Lasercutters aus Acrylglas hergestellt. Diese haben wir in einen Rahmen eingesetzt. Zusätzlich haben wir hinter die Linsen eine Diffusorschicht geklebt, damit die Farbkomponenten nicht einzeln von den Linsen vergrößert werden."}, {"location": "Berlin", "title": "Gute-Laune-Fenster", "people": ["https://github.com/maltewo", "https://twitter.com/pixiono"], "url": "https://hackdash.org/projects/562263a6d7a1daf032edaab9", "description": "Wer kennt das nicht: Man steht morgens auf, es regnet und sowieso ist alles grau/blöd/trist. Unser Projekt soll hier Abhilfe schaffen. Ein Bildschirm zeigt morgens im Bad Katzenbilder oder ähnlichen lustigen Content, dazu Datum, Uhrzeit und Wetter.Abhängig vom Wetter gibt es bei Bedarf noch einen aufmunternden Spruch.\nDie Anwendung ist erweiterbar angelegt und es ist vorgesehen, eine individuelle Anpassung des angezeigten Contents zu ermöglichen.\n\nEinsatzgebiete:\n- morgens im Badezimmer am Spiegel\n- Webapp auf dem PC\n- Head-up-Display\n\nAktuelle Plugins:\n- Wetter mit positivem Spruch\n- Datum und Uhrzeit\n- Twitter-Feed\n- RSS-Feed\n- KATZENCONTENT!!!"}, {"location": "Berlin", "title": "Privacy Patch", "people": ["https://twitter.com/ArdupiDE", "https://github.com/noahmarx", "https://github.com/JDPDO"], "url": "https://hackdash.org/projects/562263c9d7a1daf032edaabb", "description": "*Idee                                                                                                                   \nViele Leute sind schon auf die Idee gekommen die Webcams ihres Laptops abzukleben, damit sie nicht gefilmt werden können.\nDoch was ist mit Smartphones???                                                                \nSmartphones werden viel öfter als Laptops verwendet, eine Vire könnte also mehr nützliche Fotos mit dem Smartphone machen.........\nAus diesem Grund haben wir Privacy Patch entwickelt, eine interaktive Smartphone Hülle, die die Kamera auf Knopfdruck blendet oder verdeckt, es also Viren unmöglich macht gute Blider zu schießen.\n\n*Ansätze                                                                                                            \nWir haben zwei Ansätze entwickelt, die es uns möglich machen die Kamera auf Knopfdruck unbenutzbar zu machen.\nDer erste ansatz beruht darauf, dass sich viele Kameras trotz IR-Filter von IR-Licht \"blenden\" lassen. In der Hülle aus dem 3D-Drucker befinden sich einige IR-LEDs die auf die Kamera ausgreichtet sind. Wird der Knopf in der Hülle gedrückt, gehen die LEDs an und blenden die Kamera.                                                                                                        \nDer Zweite Ansatz beruht auf der Idee, ein LC-Display ohne Hintergrundbeleuchtung vor die Kamera zu hängen, welches per Knopfdruck von Schwarz auf durchsichtig geschaltet werden kann.\nDa wir kein solchese Display hatten, mussten wir eines mit Hintergurundbeleuchtung nehmen, diese ausbauen und die IC auf der Hauptplatine umgehen.                                                                                  \n\n*Namen                                                                                                                \nSoftware:                                                                                                             \n  Moritz Gehlhaar                                                                                                 \nDesign:                                                                                                                 \n  Altan Yilmaz                                                                                                      \n  Jan Ole Pieper                                                                                                 \n  Jan Petersen                                                                                                       \nIR LED:                                                                                                                  \n  Moritz Beck                                                                                                        \n  Christian Steyer                                                                                                 \nLCD Display:                                                                                                         \n  Noah Marx                                                                                                          \n  Fabian Geiselhart                                                                                        "}, {"location": "Berlin", "title": "18-5088", "people": ["https://github.com/vernans", "https://github.com/jasle", "https://twitter.com/3w_SR"], "url": "https://hackdash.org/projects/56226ca1d7a1daf032edaacb", "description": "Ein Projekt, welches sich mit dem Loggen und Visualisieren der Verkehrsdaten beschäftigt, welche nach der am 16.10. beschlossenen Vorratsdatenspeicherung von den Telefon- und Internetanbietern gespeichert werden müssen. "}, {"location": "Berlin", "title": "Teecher", "people": ["https://github.com/ponderstibbons", "https://github.com/m-iwe"], "url": "https://hackdash.org/projects/56226e81d7a1daf032edaad2", "description": "Schüler bewerten ihre Lehrer:\nJeder kennt das Problem... Eure Lehrer sind doof aber ihr wollt es ihnen natuerlich nicht persoenlich sagen, schlechte noten und so. Dieses Problem wollen wir loesen mit Teecher! Eine Seite um lehrer anonym individuel zu bewerten!\n\nEine Produktion von:\nManu\nNoah\nRobin\nMerlin\nJonnas"}, {"badges": ["Bester Code"], "url": "https://hackdash.org/projects/56226f8cd7a1daf032edaad5", "people": ["https://github.com/blueburningcoder", "https://github.com/lukasepple"], "badges_raw": ["code"], "location": "Berlin", "description": "A Jugendhackt project about reimplementing ricochet in Haskell, and rewriting it as an Library that can be called not only from Haskell but from C, Python or the like as well", "title": "Querschläger (ricochet)"}, {"location": "Berlin", "title": "NOCAM", "people": ["https://github.com/RavenAdara", "https://github.com/jugendhacker"], "url": "https://hackdash.org/projects/5622724ed7a1daf032edaada", "description": "von: Paul,Marco,Nicklas, Julian,Elias,Marius,Felix,Fabian & Raven\n\nWir haben ein Spiel (eine App) in der es darum geht Videoueberwachungscameras auszuweichen.Zusaetzlich haben wir auch eine Website die euch erklären soll worum es geht. Im Spiel läuft man in real life herum und versucht von Ueberwachungscameras die in einer karte eingezeichnet sind nicht gesehen zu werden. Wenn man erwischt wird,werden dir Punkte abgezogen und dein Smartphone vibriert. Ausserdem gibt es auch ein \"Mehrspieler mode\" wo andere Spieler eingezeichnet sind und du sie nicht treffen sollst.\n"}, {"location": "Berlin", "title": "Polivote", "people": ["https://github.com/Bubbl3gun", "https://github.com/NightLayer"], "url": "https://hackdash.org/projects/56227317d7a1daf032edaadb", "description": "Polivote ist eine Seite wo man Reformvorschläge bewerten kann.Man sieht in einer Prozentzahl angegebene leiste, wieviele Leute für den Reformvorschlag einen Daumen hoch oder einen Daumen runter gegebenhaben.Die Seite wird immer aktualisiert wenn neue Reformvorschläge vorliegen."}, {"location": "Berlin", "title": "Tweesion", "people": ["https://github.com/seven11nash", "https://twitter.com/marenz_1"], "url": "https://hackdash.org/projects/562282c4d7a1daf032edaae7", "description": "*Was kann das Porjekt?*\n\nTweesion ist eine Web App, die die Fähigkeit besitzt zu prognostizieren in wie fern ein Tweet positive resonance bei der Community hervorrufen kann. Ausserdem schlägt Tweesion dem Nutzer vor, welche Hashtags zu seinem Tweet passen würden.\n\n\n*Welches Problem löst es?*\n\nEs ist eine Hilfe um zu bestimmen ob dein Tweet den Anklang finden von dem du dir erhoffst das er ihn findet.\n\n\n*Wie haben wirs Technisch umgesetzt?*\n\nDas Tweesion Team hat sich bemüht mit den Methoden (bzw. Sprachen): Html5, JQuery, PHP, C# assoziative Speichernetze und eine möglichst effiziente Web App zu entwickeln.\n\n\n*Welche Daten benutzt Tweesion?*\n\nTweesion verwendet die Daten der Twitter API um zu bestimmen, wie bereits in Punkt 1 erklärt, Nutzern bei der richtigen Inhaltsfindung zu unterstützen."}, {"location": "Berlin", "title": "Krebs-Check24", "people": ["https://github.com/paalwi"], "url": "https://hackdash.org/projects/56228aafd7a1daf032edaaf3", "description": "Im Projekt Krebs-Check24 werden Daten visualisiert, die die Erkrankungsfälle und Todesfälle verschiedener Krebserkrankungen, getrennt nach Geschlecht un Bundesland darstellen. Die Darstellung wird mit Tableau Public umgesetzt, der Prototyp einer Website wurde mit Javascript sowie der d3-Bibliothek programmiert. Das Projekt soll das Thema für die Öffentlichkeit zugänglich machen. Dabei wollen wir die Enflüsse von Geschlecht und Bundesland veranschaulichen.\n\nEin Projekt von Theresa, Lydia, Luisa, Paula"}, {"location": "Berlin", "title": "PillBox", "people": ["https://github.com/timonmasberg"], "url": "https://hackdash.org/projects/56228cc5d7a1daf032edaaf5", "description": "Viele Menschen vergessen täglich ihre Medikamente zu nehmen. Unser Lösung dafür ist eine automatisierte Pillen Box. Sobald das Medikament eingenommen werden muss, wirft die die Box diese aus und macht sich bemerkbar. Sobald die Medizin genommen wurde, registriert die Box dies und informiert den Pfleger. Dieser kann durch ein übersichtliches und einfach gehaltenes Webinterface, die  Einnahmezeiten regeln und sich anzeigen lassen, ob ein Medikament rechtzeitig genommen wurde. Durch die Protokollierung kann der Krankheitsverlauf optimal begleitet werden und der Pfleger wird in seiner Arbeit entlastet.\nDas Herz der Box sind ein Servo-Motor und ein Fotowiderstand, die durch einen Raspberry Pi und die darauf ausgeführten Python Script gesteuert und überwacht werden. Alle Daten werden in einer MySQL Datenbank gespeichert und durch das Webinterface, welches in PHP geschrieben wurde, abgerufen. \nDie Box an sich besteht aus 10, mit einem Laser geschnittenen, Schichten, in die, die Bauteile perfekt reinpassen. \nDa das Projekt Open-Source ist, lässt es sich beliebig anpassen und ergänzen. So kann die Box, für jeden individuellen Fall erweitert werden.\n\nEin Projekt von: Johann, Ernst, Byron, Timon"}, {"location": "Berlin", "title": "Antikollisionssystem 360°", "people": ["https://github.com/larsbrinkmann", "https://github.com/1999EBro"], "url": "https://hackdash.org/projects/5622b24ad7a1daf032edab25", "description": "Wird zwischen Steuerung und Drohne geschaltet, um die Drohne vor anderen Gegenständen und möglichen Zusammenstößen zu schützen. Dafür wird das Funksignal abgefangen und gleichzeitig vom Arduino Ultraschallsensoren ausgelesen. Dadurch wird dann die finale Steuerung der Drohne beeinflusst. Auf der Drohne werden zudem, die von den Ultraschllsensoren als gefährdet gesehene Seiten, durch rote LEDs dargestellt."}, {"location": "Berlin", "title": "invisiblePGP", "people": ["https://github.com/MoritzFago"], "url": "https://hackdash.org/projects/5622cf0bd7a1daf032edab2c", "description": "invisiblePGP - das Konzept\n\nGITHUB: https://github.com/MoritzFago/invisiblePGP\n\ninvisiblePGP soll zwischen Emailclient und Emailserver 􏰂geschaltet􏰃 werden. Die Software soll als IMAP(Internet Message Access Protocol)􏰄 und SMTP(Simple Mail Transfer Protocol)􏰄Proxy realisiert werden, der ausschließlich per verschlüsselter Verbindung zwischen Emailclient und Emailserver ver- mitteln und die Emails on􏰄-the-fly􏰄􏰆, das heißt ohne das die Emails zwischengespeichert werden, ver-􏰄 und entschlüsselt.\n\nEmails werden vom Endgerät per SMTP an invisiblePGP geliefert. InvisiblePGP prüft, ob der Empfänger einen öff􏰀entlichen Schlüssel auf einem der Keyserver (ein ö􏰀ffentliches Verzeichnis von ö􏰀ffentlichen Schlüsseln) verffö􏰀entlicht hat. Sofern das der Fall ist, wird die Email mit dem ö􏰀ffentlichen Schlüssel verschlüsselt. Wenn kein öff􏰀entlicher Schlüssel bekannt ist, wird die Email nur signiert, also digital unterschrieben, um Absender und Integrität zu veri􏰅zieren. Im Anschluss verbindet sich invisiblePGP mit dem Emailserver und verschickt die Email. Wenn das Endgerät neue Emails per IMAP abruft, fragt es diese nicht direkt beim Emailserver, sondern bei der invisiblePGP an, welches seinerseits die Emails vom Emailserver erhält, sie entschlüsselt und die Signaturen überprüft. Schließlich sendet invisiblePGP die Emails transportverschlüsselt an das Endgerät. Durch diese Vorgehensweise liegen die Emails, sofern sie verschlüsselt gesendet wurden, nur in verschlüsselter Form vor."}, {"location": "Berlin", "title": "Was der BND kann...", "people": ["https://github.com/timlai0", "https://twitter.com/HermsenLuca", "https://twitter.com/JohannesLenzing", "https://github.com/lroyjnks"], "url": "https://hackdash.org/projects/5622d5c6d7a1daf032edab2f", "description": "...kannst Du auch!\n\nDiese Anwendung benutz APIs von den drei größten Sozialen Netzwerken Facebook, Instagram und Twitter um am Ende eine Übersicht von seinem Sozilen Profilen zu bekommen."}, {"location": "Berlin", "title": "CrowdFlow", "people": ["https://github.com/jatha"], "url": "https://hackdash.org/projects/5622e418d7a1daf032edab33", "description": "A tool for anylyzing crowd flow anonumusly."}, {"location": "Berlin", "title": "Eventkarte", "people": ["https://github.com/blobfisch", "https://github.com/ByteHamster", "https://github.com/kaschunuss", "https://github.com/sevenmaster"], "url": "https://hackdash.org/projects/5622e646d7a1daf032edab34", "description": "Bei großen Events wie Jugend hackt reisen unzählige Leute aus allen Himmelsrichtungen an. Dabei teilen sie sich möglicherweise sogar den selben Zug und langweilen sich in direkt nebeneinander liegenden Abteilen. Mit unserer Eventkarte ist das Vergangenheit!!\n\nBesucher einer Veranstaltung können sich vor der Anreise auf einer interaktiven Karte eintragen und ihre mit den Routen der anderen Teilnehmer vergleichen. Es können Fahrgemeinschaften gebildet werden, wodurch Langeweile bekämpft, neue Freundschaften geschlossen, sowie nebenbei noch Geld gespart und die Umwelt geschützt werden kann.\n\nFür Veranstalter ist die Karte besonders einfach in die eigene Homepage integrierbar und ist somit komplett dezentral verwaltet und individuell anpassbar."}, {"location": "Ost", "title": "zeit ist technik", "people": ["https://twitter.com/Ny_Dragon"], "url": "https://hackdash.org/projects/5572f60e79ef5d384ac04ae6", "description": ">> unsere frage(n):\n\nwas nimmt uns viel zeit im alltag?\n\n- einkaufen\n\nwieso ist das überhaupt so nervig?\n\n- man könnte während der zeit viel interessantere dinge machen\n\nwie könnte man jetzt die zeit sparen?\n\n- indem man die direkte und kürzeste route vom eingang zu den \n\nregalen und zurück zur kasse nimmt\n\n\n\n>> unsere lösung:\n\ntatata! (man glaubt es kaum)\n\nunsere app\n\n\n\n>> und die funktioniert so:\n\n- als erstes gibt man die einkaufsliste ein\n\n- dann ruft die app über die datenbanken ab welches Produkt wo steht \n\n- jetztwird nur noch der kürzeste weg vom eingang zu den regalen und \n\n   dann zur kasse\n\n\n\n2*ML"}, {"location": "Ost", "title": "Basic Computer", "people": ["https://twitter.com/JohnnyKaramello"], "url": "https://hackdash.org/projects/5572f46179ef5d384ac04ae3", "description": "Wir bauen einen Basic Computer basierend auf einem AVR Micro Controller auf dem ein Tiny Basic Interpreter laufen soll. Am Start sind Steven Jodzio, Antoni Urzykowski und Jonathan Gester. Wir starteten mit dem fast ganztägigen Versuch den Prozessor mit dem Tiny Basic interpreter zu bespielen. Dazwischen schnitten wir das Gehäuse mit dem Lasercutter des Makerspaces aus. Nach einer gefühlten Ewigkeit fanden wir heraus, dass der Prozessor durchgebrannt war. Rein zufällig hatte der Mentor Uwe einen genau gleichen Prozessor bei sich zu Hause liegen, den er auch extra für uns noch geholt hatte. Jetzt funtionierte auch das Flashen von Tiny Basic. Nach diesem Erfolgserlebnis mussten wir die Schaltung auf die Platine löten, was auch wieder sehr viel Zeit in Anspruch nahm. Jetzt ist der Computer fast fertig, aber wir hatten keine Zeit mehr das Projekt zu beenden."}, {"badges": ["Publikumspreis"], "url": "https://hackdash.org/projects/5572e22a79ef5d384ac04ad6", "people": ["https://twitter.com/raubraupe"], "badges_raw": ["audience"], "location": "Ost", "description": "In unserem Projekt versuchen wir durch das Schaffen von offenem WLan der Natur zu helfen, indem wir einen Baum mit einem WLan-Router ausstatten, der aktiviert wird, wenn der Baum bewässert  wird. Man bewässert den Baum, indem  man mit einem Fahrrad fährt, das eine Pumpe antreibt und gleichzeitig den WLan-Router über einen Dynamo mit Strom versorgt. Als alternative Energiequelle dient eine Schaukel, die ähnlich wie ein Wellenkraftwerk funktioniert.\n\nLeeloo, Yola, Tita\n\nunterstützend: Hanna, Mirko, Christoph, Valentin", "title": "TreeFi"}, {"badges": ["Sonderpreis"], "url": "https://hackdash.org/projects/5572d43379ef5d384ac04ac6", "people": ["https://twitter.com/MariusMauksch"], "badges_raw": ["special"], "location": "Ost", "description": "a) Die App soll das fahren ohne rote Ampeln durch die Stadt ermöglichen \n\nb) Man soll durch die App nicht mehr an Ampeln stehen bleiben müssen.\n\nc) folgende Daten auswerten:\n    \n        1. Fahrerposition\n        2. Geschwindigkeit\n        3. Richtung /Route\n        4. Nächste Ampel auf dem Weg?\n        5. Ist die Ampel Rot oder Grün? (Gelb = Rot)\n        6. Wie lange hat sie noch diesen Zustand?\nDann als Ton oder Lichtsignal dem Nutzer ausgeben, ob er sich beeilen  muss    um das grün noch zu schffen, ob er es sowieso nicht schafft und   lieber   langsam fährt, um das nächste grün zu bekommen oder ob er   sich   zeitlassen kann, weil rot ist aber gleich grün wird.\n\nd) 1. Wo ist der Fahrer? Es werden die GPS daten des Fahrers benötigt.\n        2. Wie schnell ist er? siehe 1.\n        3. Wo lang fährt er? vorher angegebene route\n        4. Wo ist die Ampel? GPS daten der Ampel\n        5. Ist die Ampel rot oder grün? (gelb = rot) ?\n        6. Wie lange hat sie diesen zustand noch  ? ?\n\n\n\nTechnische Bestandteile: \n\n    Ampelstandpunkte in der Stadt \n\n    Schalttzeiten der Ampeln\n\n    Standpunkt des Fahrers (Geschwindichkeit durch GPS)", "title": "MeineGrüneWelle"}, {"badges": ["Aha Moment"], "url": "https://hackdash.org/projects/5572d3bc79ef5d384ac04ac0", "people": ["https://twitter.com/pajowu", "https://twitter.com/marenz_1"], "badges_raw": ["innovation"], "location": "Ost", "description": "Die Welt steht vor dem Abgrund! \n\nFür diejenigen unter uns, die das absolut nicht verarbeiten können, gibt es nun Neulandeuphonie!", "title": "Neulandeuphonie"}, {"badges": ["Bestes Design"], "url": "https://hackdash.org/projects/5572d02679ef5d384ac04ab4", "people": ["https://github.com/seven11nash"], "badges_raw": ["design"], "location": "Ost", "description": "Developer: Max, Stefan, Marc \n\n\nTitel: Taxi Travel Time\n\n\nErklärung: \n\nA)\nIm Taxi Travel Time Projekt geht es darum den Taxi Betreibern zu helfen, ihre Ressourcen möglichst effizient einzusetzen, um kosten und Personen zu schonen und den Fahrgast eine möglichst angenehme Reise zu ermöglichen.\n\nB)\nEs löst das Problem der verschwenderischen Ressourcen Nutzung im angesicht von Klimawandel  und Ressourcen Knappheit.\n\nC)\nMit:\nCSS, HTML & Javascript Frontend\nC#, OSM API & MongoDB Backend\n\nD)\nhttps://www.kaggle.com/c/pkdd-15-taxi-trip-time-prediction-ii\n\n ", "title": "Taxi Travel Time"}, {"badges": ["Bester Code"], "url": "https://hackdash.org/projects/5572bfcc79ef5d384ac04a96", "people": ["https://twitter.com/DieOberGeilen", "https://twitter.com/ianbeu"], "badges_raw": ["code"], "location": "Ost", "description": "Einfaches Lagersystem für public sharing im Rahmen von #hyc15. Es soll das kostenlose Tauschen verschiedenster Artikel ermöglichen und somit der materiellen Verschwendung entgegen wirken.\n\nEntwickler: David, Martin, Marco, Ian, Lars, Daniel und Maurice", "title": "Easybay"}, {"badges": ["Mit Code die Welt verbessern"], "url": "https://hackdash.org/projects/5572b30179ef5d384ac04a5a", "people": ["https://github.com/chk1", "https://twitter.com/GolmTv", "https://github.com/jugendhacker"], "badges_raw": ["world"], "location": "Ost", "description": "Der Intelligente Mülleimer prüft, ob er voll ist, und schickt dann eine Meldung an die städtische Müllabfuhr und eine Lampe leuchtet Rot auf.\n\nHardware:\n\n- Arduino  \n- Distanzsensor mit Infrarot\n- Gehäuse aus dem Lasercutter\n\nGebaut von Julian, Kolja, Tigran und Paul\n\nCode, Schaltpläne und Fotos unter:  \nhttps://github.com/jugendhacker/Muelltonne", "title": "Intelligente Mülltonne"}, {"location": "Süd", "title": "Schatzjäger", "people": ["https://twitter.com/oloipop"], "url": "https://hackdash.org/projects/557c41793f8689f158e0f3cf", "description": "Unser Projekt soll die Leute wieder auf die Werbung aufmerksam machen, indem man aus Werbung eine Art Spiel mit Punkten macht. Halte nach Werbeplakaten mit QR-Codes Ausschau und hoffe, dass es unser QR-Code ist. \n\nEs soll die Leute anregen die Werbung wieder genauer anzuschauen, da es Sachen geben kann, die sie interessieren könnten, aber die sie nicht sehen, weil sie diese beim Reden mit Freunden, beim Schreiben oder Spielen am Handy nicht beachten. \n\nWir haben zum Erstellen dieses Projektes dillinger, stackedit, Github und Notepad++\n\nDas heißt, dass wir eigentlich nix anderes als eine \"Werbung-Schnitzeljagd\" mit kleinen Preisen machen.\n\nNatürlich ist es nicht möglich so schnell Preise oder Ähnliches bereit zu stellen. Dies wird sich vielleicht im Laufe der Zeit ändern.\n\nSchatzjäger entstand aus der Idee von\nFlorian T. und Christoph M. Gleim"}, {"badges": ["Bestes Design"], "url": "https://hackdash.org/projects/557c29453f8689f158e0f3c7", "people": ["https://twitter.com/Fa99bi", "https://github.com/ByteHamster"], "badges_raw": ["design"], "location": "Süd", "description": "Wir haben uns als Ziel genommen, das \"neue\" System PGP (Pretty Good Privacy) euch näher zu bringen.\nUnser Ziel ist es, eine Homepage zu erschaffen, welche eine individuelle Anleitung gibt, wie man PGP nutzt.\nDabei gehen wir auf verschiedene Betriebssysteme, z.B. Windows, Mac, Linux, und (E-Mail-)Programme , wie Outlook und Thunderboard, ein.\nAufgrund eines Fragebogens werden Daten ermittelt, welche anschließend zur individuellen Lösung navigieren - soviel mal zur Idee.\n\nWir Arbeiten unter anderem mit den Programmen NetBeans, GitHub und Xampp.\n\nKurz zu uns:\nWir waren seit Beginn des Projektes ein Team aus 5 Personen, welches jeglicher Layouts, Animationen, ... selbst erstellt hat. \nNoch ein kleines Dankeschön das Betreuungsteam welches uns oft zur Seite steht/stand und Probleme gelöst hat :D\n\nFür Fragen jeglicher Art stehen wir in den Kommentaren zur Verfügung \nBitte folgenden Hashtag verwenden: #PGPquest\n\nNachtrag: Die Seite wurde noch während des Projektes mit den Grundfunktionen fertiggestellt.\n\n----------\nUpdate 26.10.2015:\nEndlich haben wir es geschafft, unsere Seite weiter zu entwickel, sodass die meisten Funktionen richtig laden. Ebenso konnten wir uns eine Unterseite von der offiziellen \"Jugendhackt.de\"-Seite ergattern.\nDer Link zu unserem Projekt ist weiter unten verlinkt.\nWeiterhin weisen wir daraufhin, dass sich an der Seite noch etwas verändern kann - sie ist also noch nicht zu 100% fertiggestellt.\n\nBei Verbesserungsvorschlägen, auftretenden Fehlern oder sonstigem sind Kontaktdaten unter dem Punkt \"Impressum\" festgehalten. Gerne freuen wir uns über die Rückmeldung.\n\n----------\nUpdate 14.12.2015:\nAuch wenn unser Projekt nur langsame Fortschritte macht, so arbeiten wir teils immer noch daran weiter. Erst heute ist wieder eine neue Version erschienen. Hinzugefügt wurde der Punkt \"Feedback senden\" in der Fußleiste sowie einige Ergänzungen auf der englischsprachigen Seite.\n\n----------\nUpdate 10.02.2016:\nDie Seite macht langsam Fortschritte. Erst kürzlich haben wir unser komplettes Layout deutlich ansprechender gestaltet.  Die spezifische Anleitungen zu den jeweiligen Betriebssystemen/Mailprogrammen wurden in kleinere und einfacher lesbare Abschnitte aufgeteilt. \nDesweiteren wurde eine Leiste zum Fortschritt hinzugefügt, welche anzeigt, wie viele der benötigten Informationen bereits gegeben wurden.\n----------\nZeitaufwand: ca 14-15 Stunden (bis zur Beta-Version)         \nLetztes Update: 10.02.2016 18025 Uhr", "title": "PGP - HowTo"}, {"badges": ["Publikumspreis"], "url": "https://hackdash.org/projects/557c16883f8689f158e0f3c3", "people": ["https://twitter.com/BIackdead"], "badges_raw": ["audience"], "location": "Süd", "description": "World of SchoolCraft (kurz WoSC) ist ein Projekt mit dem wir versuchen wollen, das Hausaufgabenmachen zu revolutionieren. Unser Team möchte die Schüler/-innen dazu motivieren, ihre Hausaufgaben gewissenhaft und regelmäßig zu erledigen, freiwillig zu lernen und somit langfristig ihre schulische Leistung zu verbessern. Dies wollen wir über ein ExperiencePoint (kurz XP) System erreichen. Die Schüler/-innen sollen XPs für verschiedene Aufgaben wie z. B. erledigte Hausaufgaben, Referate, Klassenarbeitsnoten, anspruchsvolle Bonusaufgaben, Tafel-/Ordnungsdienst, positives Verhalten oder das Beantworten von Fragen erhalten. \n\nDie gesammelten Punkte können gegen verschiedene Belohnungen eingetauscht werden. Dazu zählen unter anderem das Sammeln von Vorteilen (z. B. Informationen/Aufgabenstellungen aus Klassenarbeiten zu erfahren) und Bonuspunkten, um darüber die eigne Note zu verbessern. Weitere Möglichkeiten für Belohnungen sind Sitzplatzwahl im Klassenzimmer, kleine Geschenke (Schulmaterialien). \n\nDie Mitschüler/-innen können verschiedene Ränge erreichen, die mit Abzeichen und unterschiedlichen Skins für einen persönlichen Avatar für jeden ersichtlich sind, und in einem Highscore-Ranking verglichen werden. Alle Daten können nach einem Login zentral über eine Website dargestellt werden, auf der auch das Quiz gespielt werden kann. Auf der Website soll es auch einen Marktplatz geben. \nLehrer können selbst Aufgaben für die Schüler integrieren und neue Inhalte über den QuestCube anzeigen.\n\nÜber eine Windows-Anwendung lässt sich der aktuelle XP-Stand auf externer Hardware anzeigen. Das Projekt wird technisch mit Hilfe mehrerer ARDUINOs, eines C#-Programm und der Client-Server basierenden Website umgesetzt, welche alle miteinander kommunizieren.\n\nSpäter sollen noch Apps für die verschiedenen Plattformen entwickelt werden. Außerdem soll ein Roboter (basierend auf ARDUINO/Raspberry Pi) als kleine Spielfigur eingeführt werden, der dann mit für XPs gekauften Fähigkeiten verbessert werden kann. \n\n\n\n――――――――――――――――――――――――――――――――――――\nUnser Team:\n»Tim Pelzl »Kilian Traub »Martin Rueß »Lukas Braungart", "title": "World of SchoolCraft"}, {"badges": ["Sonderpreis"], "url": "https://hackdash.org/projects/557c08ad3f8689f158e0f3bf", "people": ["https://twitter.com/Toxicola_", "https://twitter.com/ArdupiDE"], "badges_raw": ["special"], "location": "Süd", "description": "KOMPLEXiS ist nicht einfach nur ein Gerät das es zuvor nie gab. Es ist einfach in allem genial. Findet freies WLAN, sagt dir ob in deiner nähe viel Gas ist und ist unglaublich energieeffizient. Um ein effizientes Gerät zu entwickeln, dass die ganze Zeit Scannt, mussten wir die Grenzen unserer Hardware und Software Kenntnisse gehen.\nDas Gehirn von KOMPLEXiS ist ein Raspberry Pi und ein Arduino, der mit mehreren Sensoren und Modulen verbunden ist. Unter anderem WiFi und\nNach einem Software Update können unteranderem Gyroskop, Temperatur und Lichtsensoren angesprochen und verarbeitet werden.\nInformationen werden über mehrere LED's wiedergegeben.\n→ Das Team:\n\n► Henning Klatt                                                                                                      ► Fabian Geiselart                                                                                                ► Jonathan Kowa                                                                                                 ► Ilias Ennmouri-May", "title": "♦→ KOMPLEXiS ←♦"}, {"location": "Süd", "title": "Vollüberwachter Raum", "people": ["https://twitter.com/RyluGaming"], "url": "https://hackdash.org/projects/557c05813f8689f158e0f3be", "description": "Unser Vollüberwachter Raum ist dazu da aufzuzeigen, wie viele Daten allein durch den Aufenthalt in einem Raum über eine Person gesammelt werden können.\nDazu verwenden wir eine Raspberry Pi Kamera mit Gesichtserkennungssoftware (http://134.60.149.160:8080/stream.html)\nund einen Wlan-Hotspot, an dem aufgerufene Websites ausgelesen werden"}, {"badges": ["Mit Code die Welt verbessern"], "url": "https://hackdash.org/projects/557c01f63f8689f158e0f3bb", "people": ["https://twitter.com/BadToxic", "https://twitter.com/SakineDilara"], "badges_raw": ["world"], "location": "Süd", "description": "Unser Projekt \"Game of Life\" soll spielerisch aufzeigen, inwiefern der Zufall, unsere Entscheidungen und die Gesellschaft unser Leben beeinflussen. Dadurch macht es auf Probleme in unserer Gesellschaft aufmerksam.\n\n\nEs basiert auf den vier Masken des Lebens: Herkunft, körperlicher Beschaffenheit, Talente / Angeborene Veranlagungen und der Selbstverwirklichung.\n\n\nIm Spiel werden dabei die ersten drei Masken, wie im echten Leben auch, zufällig gewählt und ergeben zusammen den Charakter des Spielers. Mögliche Variablen sind Geschlecht,Hautfarbe, Sexualität, Herkunft und Gesunheitszustand (Behinderung, etc.). Die letzte, die Selbstverwirklichung, involviert den Spieler. Angepasst an die jeweilige Situation wird der Spieler mit Entscheidungsfragen konfrontiert, die in begrenzter Zeit beantwortet werden müssen.\n\n\nJe nachdem welcher Weg gewählt wurde, wirkt sich dies einerseits auf die folgenden Fragen und Ereignisse, andererseits auf die Bedürfnistabelle aus. Diese umfasst Liebe, Glück, Gesundheit, Stress und Finanzen und können sich auch untereinander beeinflussen. Außerdem steht ein \"EXIT-Button\" zur Verfügung, der ein zufälliges Ereignis herbeiführt und die Situation komplett ändern kann.\n\n\nDas Spiel steht auf unserer hier verlinkten Internetseite zur Verfügung zum Ausprobieren im Browser (HTML5) und zum Runterladen für Windows (exe) und Android (apk).\n\n\nBei der Entwicklung haben wir den Game Maker genutzt.\n\n\n\n== Team ==\n\nJohannes Gaus\n\nJannek Link\n\nLea Schubert\n\nHendrik Hoffmann(obsidna)\n\nNuria Gässler\n\nSelina Dilara Soysal\n\nMichael Grönert (Mentor)", "title": "Game of Life"}, {"badges": ["Aha Moment"], "url": "https://hackdash.org/projects/557c019c3f8689f158e0f3ba", "people": ["https://twitter.com/Spytobi05", "https://twitter.com/vokativ1"], "badges_raw": ["innovation"], "location": "Süd", "description": "Diese Website ist speziel dfür da um sich personalisierte Fahrrad-/Wanderwege anzeigen zu lassen.", "title": "SMAP"}, {"location": "Süd", "title": "Dynamic Transit", "people": ["https://twitter.com/html5ben"], "url": "https://hackdash.org/projects/557bfbf43f8689f158e0f3b5", "description": "Eine kleine, aber feine Webapp für Smartphones, die es Nutzern des öffentlichen Nahverkehrs ermöglicht, ohne jegliche Voreinstellungen Anfragen in Form von Lob oder Kritik an den Verkehrsverbund zu senden."}, {"location": "Süd", "title": "BraceLight", "people": ["https://twitter.com/rene_uchiha"], "url": "https://hackdash.org/projects/557bf7463f8689f158e0f3ae", "description": "Projektteilnehmer: Lukas (Hardware), René (Website/PHP + Datenbank/App), Noah (App), Moritz (Armband/3D-Druck), Paul\n\nBraceLight ist ein Armband, welches dem Anwender anhand von zwei LED Lichtern einkommende Anrufe oder anstehenden Regen, etc. mitteilt.\nEs löst ein Alltagsproblem, indem man vorzeitig über Regen, o.Ä. informiert wird und erleichtert einem generell den Alltag wie z.B. durch das Hinweisen auf einkommende Anrufe auf dem Handy über ein mehrfahrbiges LED.\n\nDie Technische Umsetzung sieht folgendermaßen aus:\n- Das Armband verbindet sich per Bluetooth zum Handy des Nutzers.\n- Das Handy verbindet sich zur MySQL Datenbank (welche von einer Website immer aktualisiert wird)\n- Die von der Datenbank gesammelten Daten über Wetter, etc werden an das Armband weitergeleitet und als LED ausgegeben.\n\nIn dem Projekte wurden folgende Daten verwendet:\n- Es wird der aktuelle Standort über die IP herausgefunden (api.hostip.info)\n- Die Ortsspezifischen Wetterdaten bekommen wir durch die OpenWeatherMap (api.openweathermap.org)\n\n\nDas Armband verbindet sich dabei per Bluetooth mit dem Handy des Anwenders, welches die Daten über Wetter, etc von einer externen Datenbank ausliest und anschließend zurück an das Armband schickt."}, {"location": "Süd", "title": "Umwelt Challenge", "people": ["https://twitter.com/rinhia"], "url": "https://hackdash.org/projects/557bf5a73f8689f158e0f39c", "description": "Unser Projekt soll Menschen aufrufen Strom/Resourcen/CO2 einzusparen .\nDazu soll jeder Nutzer eine Wochenchallenge bekommen.\nDurch die (ehrliche) Rückmeldung des Nutzers wird eine Punkteskala personalisierte aufgefüllt.\nEin kleines Display für zu Hause/ in der Schule/ auf Arbeit etc.\nzeigt den Aktuellen stand der Personen an und regt so den Wettbewerbsgeist an.\nHannes und Zoe"}, {"badges": ["Bester Code"], "url": "https://hackdash.org/projects/557bf10f3f8689f158e0f371", "people": ["https://github.com/lukasepple", "https://github.com/froozen"], "badges_raw": ["code"], "location": "Süd", "description": "Magisches™ Paketerouting! 100% Biologisch und Gentechnikfrei.\n\nTransport erfolgt über Freiwillige, die sich freiwillig bereiterklären, in bestimmten Bereichen Pakete zu transportieren. Über diese freiwillige wird ein Paket dezentral geroutet.\n\nMy little Decentrality: Packets are Magic.\n\nBrought to you by the good people Bez, Brotknust and sternenseemann", "title": "Paketmagie"}, {"badges": ["Mit Code die Welt verbessern"], "url": "https://hackdash.org/projects/55f3ea1d74d6ac1d21451651", "people": ["https://github.com/annabertsch", "https://github.com/geoextra", "https://github.com/Breuxi", "https://github.com/Pr0duktiv", "https://twitter.com/pajowu", "https://github.com/games647"], "badges_raw": ["world"], "location": "West", "description": "Mit dem Projekt 'Germany says Welcome' widmen wir uns einem der aktuellsten Themen überhaupt- Der großen Anzahl an Flüchtigen in Deutschland.\nDiese Flüchtlinge fühlen sich hier oft hilflos, alleingelassen und überfordert vom Informationsfluss. Das wollen wir ändern.\n'Germany says Welcome' soll sowohl als App als auch im Netz eine Plattform für Informationen, Hilfe und Unterstützung bei der Integration dienen.\nSowohl Flüchtlinge als auch freiwillige Helfer sollen die Möglichkeit zum Austausch auf dieser Plattform haben und damit eine Möglichkeit haben, Deutschland vielleicht zu einem etwas weltoffneren Ort zu machen.\nInzwischen sind wir auch online.- Auf http://www.germany-says-welcome.de\n\nProjekt von Patrice Becker, Anna Bertsch, Jan Breuer, Pierre Buschmann,  Moritz Gehlhaar,  Roman Kobosil, Kevin Schatto, Alexander Siegler und David Weber", "title": "Germany says Welcome"}, {"badges": ["Bester Code"], "url": "https://hackdash.org/projects/55f40f4974d6ac1d2145167e", "people": ["https://twitter.com/weatheredtowns", "https://twitter.com/alexsteinerde", "https://twitter.com/lul3be"], "badges_raw": ["code"], "location": "West", "description": "Das 'Bestival' Projekt ermöglicht Konzert- und Festivalbegeisterten eventspezifische Playlists auf Deezer zu kreieren. Die App durchsucht den Kalender des Smartphones nach eingetragenen Konzerten und Festivals und erstellt dann in der Musik-App 'Deezer' eine Playlist für das jeweilige Event - somit hat der User die Möglichkeit, sich die Musik der Bands vor dem Auftritt anzuhören. Mit 'Bestival' können sowohl iOS als auch Android User ihre Kalender mit ihren Playlists synchronisieren. \n\nAutoren: Leander Berg, Björn Ternes, Alex Steiner, Clara Schlossberger", "title": "Bestival"}, {"badges": ["Bestes Design"], "url": "https://hackdash.org/projects/55f426db74d6ac1d21451697", "people": ["https://github.com/gtomitsuka", "https://twitter.com/altan3008", "https://twitter.com/LucaVNR"], "badges_raw": ["design"], "location": "West", "description": "Social-Running ermöglicht es dem Nutzer in einem von Ihm gewählten Umkreis mit anderen Nutzern in Kontakt zu kommen, um mit ihnen gemeinsam Sport zu treiben. Auf einer Karte kann der Nutzer andere Nutzer sehen die zur gleichen Zeit die gleiche Aktivität ausführen und sich diesen anschließen. Falls der Nutzer keine anderen Nutzer zu den von in angegebenen Zeiten findet kann er eine neue Aktivität erstellen und diese auf die Karte setzen. \n\nAlleine laufen motiviert den Läufer nicht und bringt den Läufer dazu nach kurzer Zeit mit dem laufen aufzuhören. An dieser Stelle kommt Social-Running ins Spiel, dadurch dass der Sportler die Sportarten gemeinsam mit anderen ausführt bleibt die Motivation bestehen und die Sportler werden Ehrgeiziger. Außerdem lernen die Sportler neue Personen und Locations kennen. Auf lange Sicht steigert der Sportler somit nicht nur seine Leistungen sondern auch sein soziales Umfeld.\nTechnische Umsetzung:\nUm die Web-App „Social-Running“ auf die Beine zu stellen haben wir im Frontend Bereich Angular.js und eine Google Maps API. Im Backend-Bereich kamen Node.js und MongoDB zum Einsatz.\n\n\nUnsere Karten beziehen wir von Google Maps und die restlichen Daten stammen von uns.\n\nAutoren:Andreas,Philipp,Luca,Gabriel,Altan", "title": "Social-Running"}, {"badges": ["Aha Moment"], "url": "https://hackdash.org/projects/55f3ee8274d6ac1d21451654", "people": ["https://github.com/fuzzyleapfrog", "https://twitter.com/srall99", "https://twitter.com/FuzzyLeapfrog"], "badges_raw": ["innovation"], "location": "West", "description": "Menschenströme erfassen ohne Kamera - Warum?\n\nWenn Kameras gar nicht erst vorhanden sind, können sie auch nicht missbraucht werden!    \n\n+ anonym\n+ datensparsam\n+ geringerer Speicherplatz nötig\n+ billiger\n\n     ...und weil wir es können!\n\nMittels Sensor(en) & Arduino(s) Menschen im Raum erfassen und die Daten auswerten.\n\n__Hardware:__Abstandssensor (misst Geschwindigkeit und hat eine Annäherungsampel) plus kreuzende Lichtschranke (misst Personenanzahl) inklusive Designgehäuse für den Abstandssensor\n\nWir messen Deine Geschwindigkeit, zählen Dich, wissen ob Du rein/raus gehst und warnen wenn Du zu nah bist ... alles anonym.\n\nNutzung:\nStatistische Analyse von Menschenströmen und Ableitung einer Prognose für künftige Events, Gebäude oder öffentliche Plätze.\n\nSimon Welz, Lars Dessau, Jael Katrin Fleckenstein, Paula Stahl, Anton Sagel\n\n", "title": "Menschenströme anonym erfassen"}, {"location": "West", "title": "Menschenströme erfassen", "people": ["https://twitter.com/maxmunzel", "https://twitter.com/keija42", "https://github.com/leomaron"], "url": "https://hackdash.org/projects/55f4354f74d6ac1d214516a5", "description": "Warum:\n           Die Menschenströme bei Bussen, Bahnen, Events etc. erfassen\n\n\nDie Daten kommen:\n           von eigener Erfassung\n\nWie:\n           Triangilation von mobilen Endgeräten mit WLAN probe-requests\n\nDie Technik: Mit einem Raspberry Pi + WLAN Karten + tshark/aircrack\n\nZiel: Die überfüllten Bahnen,Busse vermeiden oder bei Events die Besucherströme vermeiden \n\nDeveloper: Max Nagy, Anna Keune, Gregor Michels, Leo Maroni"}, {"location": "West", "title": "Das News Ding", "people": ["https://twitter.com/mob_doom", "https://twitter.com/crangosoft"], "url": "https://hackdash.org/projects/55f3ebbc74d6ac1d21451652", "description": "Autoren:\nLevy Ehrstein, David Schmidt, Felix Schlegel, Felix Gebel, Max Gebel, Peter Heynmöller, Lars Schröder\n\nBeschreibung:\nDas News Ding is ein Projekt zur Entwerfung einer News-Website, die dir immer nur die Neuigkeiten anzeigt, die dich interessieren. Natürlich kann man sich auch einfach beliebte oder aktuelle Nachrichten anzeigen lassen. Dabei löst es das Problem vieler andere News-Websites, wie z.B. Yahoo oder Spiegel-online, dass man von Nachrichten benachrichtigt wird, die einen gar nicht interessieren. Wir setzen dieses Projekt mit einem Raspberry-Pi als Webserver und mit einer MySQL Datenbank um. Geplant ist es später die Daten von verschiedenen RSS-Feeds zu nutzen."}, {"location": "West", "title": "TAG ME", "people": ["https://twitter.com/HealthyChecker"], "url": "https://hackdash.org/projects/55f3ff0074d6ac1d2145167a", "description": "Bei unserem Projekt geht es um eIne Bewertungsapp mit dem Focus auf Gesundheitliche Orte und Bereiche neue #Ideen anregen will. An bestimmten Orten können nach dem Verifizieren durch einen registrierten QR-Code vor Ort Bewertungen vergeben Der vorteil ist das man nur Orte bewerten kann die man \nwirkilch besucht hat. Das bewirkt das keine Bewertungen mehr gefälscht werden  können."}, {"location": "West", "title": "Rennstarter", "people": ["https://github.com/fuzzyleapfrog"], "url": "https://hackdash.org/projects/55f5440274d6ac1d214516b9", "description": "Startampel mit Licht und Ton plus Rundenzähler\n\nWarum nur Menschen- und nicht auch Autoströme messen? Start im Kleinen: Für Carrerabahn.\n\nJonas Griepentrog, Julian Bosch"}, {"badges": ["Sonderpreis"], "url": "https://hackdash.org/projects/55fd9cd928775a823ff167d4", "people": ["https://twitter.com/Mondanzo"], "badges_raw": ["special"], "location": "Nord", "description": "Mirrorsveg VR ist ein Beta Spiel das an Mirror Edge angelehnt ist\nund ein spiel ist worum es geht Fässer zu sammeln und die\nBienen zu retten\n\n\n\nBei Fragen oder mithilfe bis um 23:00 bitte über Slack Mondanzo anschreiben!\n\nSlack: #mirrorveg\n\n\n\n     Mirrorveg, wieso du es spielst? Weil du die Bienen retten wilst\n", "title": "Mirrorsveg VR"}, {"location": "Nord", "title": "invisiblePGP", "people": ["https://twitter.com/MoritzFago"], "url": "https://hackdash.org/projects/55fd9b6c28775a823ff167d3", "description": "invisiblePGP - das Konzept\n\nGITHUB: https://github.com/MoritzFago/invisiblePGP\n\ninvisiblePGP soll zwischen Emailclient und Emailserver 􏰂geschaltet􏰃 werden. Die Software soll als IMAP(Internet Message Access Protocol)􏰄 und SMTP(Simple Mail Transfer Protocol)􏰄Proxy (s. Abb. 1 u. 2) realisiert werden, der ausschließlich per verschlüsselter Verbindung zwischen Emailclient und Emailserver ver- mitteln und die Emails on􏰄-the-fly􏰄􏰆, das heißt ohne das die Emails zwischengespeichert werden, ver-􏰄 und entschlüsselt.\n\nEmails werden vom Endgerät per SMTP an invisiblePGP geliefert. InvisiblePGP prüft, ob der Empfänger einen öff􏰀entlichen Schlüssel auf einem der Keyserver (ein ö􏰀ffentliches Verzeichnis von ö􏰀ffentlichen Schlüsseln) verffö􏰀entlicht hat. Sofern das der Fall ist, wird die Email mit dem ö􏰀ffentlichen Schlüssel verschlüsselt. Wenn kein öff􏰀entlicher Schlüssel bekannt ist, wird die Email nur signiert, also digital unterschrieben, um Absender und Integrität zu veri􏰅zieren. Im Anschluss verbindet sich invisiblePGP mit dem Emailserver und verschickt die Email.\nWenn das Endgerät neue Emails per IMAP abruft, fragt es diese nicht direkt beim Emailserver, sondern bei der invisiblePGP an, welches seinerseits die Emails vom Emailserver erhält, sie entschlüsselt und die Signaturen überprüft. Schließlich sendet invisiblePGP die Emails transportverschlüsselt an das Endgerät. Durch diese Vorgehensweise liegen die Emails, sofern sie verschlüsselt gesendet wurden, nur in verschlüsselter Form vor.\n"}, {"badges": ["Aha Moment"], "url": "https://hackdash.org/projects/55fd9b5228775a823ff167d2", "people": ["https://twitter.com/niko_nava"], "badges_raw": ["innovation"], "location": "Nord", "description": "Virtueller 3D Rundflug durch Hamburg mit Anreicherung von Metadaten aus \"Open Data\" Quellen (Lärm, Baumkataster) des Hamburger Transparenzportals.\n\nJulian, Ernst, Marc, Timon, Yanis", "title": "Life Is Complex"}, {"location": "Nord", "title": "SchoolNet", "people": ["https://twitter.com/BlackTigersHD", "https://github.com/klopstedt", "https://twitter.com/pixiono", "https://github.com/maltewo"], "url": "https://hackdash.org/projects/55fd780874d6ac1d214517f9", "description": "Dieses Projekt soll ein Open Source Schulsystem ähnlich dem Vewaltungssystem iServ werden. Dabei fokussieren wir uns während des Hackathons vorwiegend auf die Verteilung von Aufgaben vom Lehrer an die Schüler und die Lösungsabgabe der Schüler. Der Lehrer kann anschließend sehen, welche Schüler die Aufgabe bereits bearbeitet haben und die Lösungen als richtig oder falsch markieren. Dies kann nun wiederrum vom Schüler abgefragt werden."}, {"location": "Nord", "title": "GameOver21", "people": ["https://twitter.com/NameLossLP"], "url": "https://hackdash.org/projects/55fd6cd074d6ac1d214517d3", "description": "Developed by Jonas(Seryous) and Niklas(Millexo)\n\nName of the Project: GameOver21\n\nWe wanted to show the public how it looks like in Syrien, because in German Media(TV for ex.) nobody is talking about it or showing pictures from it. We want to change this! We coded the Game in Unity and the Launcher is coded in QT(C++). We currently only have 2 levels, one in the Galaxy and on at a flat world. Later will come the Syrien level. And we also want to make it in VR."}, {"location": "Nord", "title": "ZEICHNE DEINE ZUKUNFT", "people": ["https://twitter.com/Status6"], "url": "https://hackdash.org/projects/55fd4ca574d6ac1d214517bb", "description": "we want to make an Apps for developing the Education and Hobbies for all students so they  can start their professional life in an Early age and for free all around the world \n\nWir wollen eine Plattform entwickeln, mit der Schueler und Unternehmen zusammen kommen. Unternehmen bieten Plaetze fuer Schuelerbetriebspraktika an, mit denen die Schueler zukuenftige Berufe ausprobieren koennen. Die Schueler koennen ihre Praktikumsplaetze bewerten.\n\nمشروعنا يقوم على اساس تطوير تطبيقات لتطوير مواهب الأطفال و طلاب المدارس بحيث يستطعون ممارسة هواياتهم و نشاطاتهم على أيدي محترفين و بشكل مجاني في جميع أنحاء العالم\n\n\n\n \n"}, {"badges": ["Mit Code die Welt verbessern"], "url": "https://hackdash.org/projects/55fd48cc74d6ac1d214517b5", "people": [], "badges_raw": ["world"], "location": "Nord", "description": "Wozu CoAction?:\nWir wollen eine Art Internetverzeichnis für soziale Projekte in Hamburg bauen. Dies soll denen diene die sich sozial in ihrer Stadt engagieren wollen aber nicht genau wissen wie. \nZudem kann man bei uns auch ein eigenes soziales Projekt auf die Beine stelle und andere dazu einladen.\n\nVon: Emmi Sauter und Sheeva Asafu-Adjei\n", "title": "Soziales Hamburg/CoAction"}, {"badges": ["Bester Code"], "url": "https://hackdash.org/projects/55fd3ee374d6ac1d214517ac", "people": ["https://twitter.com/LPTheGenesis"], "badges_raw": ["code"], "location": "Nord", "description": "A little anti-cheat to detect Aimbot's and Triggerbot's. To guarantee FAIR-PLAY. We grab the micemovent on a RaspberryPi2 and compare it with the gamemovent. We emulate for a mice with an Arduno Micro. Mousemovent will be converted in BYTES and transmitted with UART. But @themoment Work in Progess. ;)\n\nHave FUN\n\nGreetz Icy-Dagger-Team", "title": "Anti-Cheat"}, {"location": "Nord", "title": "The Cube", "people": ["https://github.com/isherzad", "https://twitter.com/alex1velkov", "https://github.com/Charly2000", "https://github.com/Rubinius01", "https://github.com/jophil0204"], "url": "https://hackdash.org/projects/55fd36d074d6ac1d21451794", "description": "3D Jump n' Run Rätsel Spiel in First-Person Ansicht bei dem es darum geht, in Würfelförmigen Levels Rätsel zu lösen und letztendlich dem riesigen Würfel zu entkommen.\n\nslack: #thecube\n\nEntwickler:\n\nIlias;\nMalte;\nThjorven;\nRuben;\nJohannes;\nYannick;\nAlex"}, {"badges": ["Bestes Design"], "url": "https://hackdash.org/projects/55fd2a6474d6ac1d2145177e", "people": ["https://twitter.com/fga", "https://twitter.com/RazerNoah", "https://twitter.com/moritz157", "https://github.com/jossiwolf"], "badges_raw": ["design"], "location": "Nord", "description": "An app to help both refugees and helpers in the region of Hamburg (for now) to reduce the chaos, with features like:\n\n- Refugees can register their arrival time and location\n- Helpers can see that and prepare accordingly\n- People interested get objective information\n- Everybody can donate\n- Emergency option for refugees\n- See local refugee locations on a map\n\nUpdate: The demo URL is no longer private!", "title": "Moin Refugees"}]